pws-hw22-client/xml-resources/web-service-references/CustomerAuthenticationService/wsdl/localhost_8080/pws-hw22/CustomerAuthenticationService.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.1-b419 (branches/2.3.1.x-7937; 2014-08-04T08:11:03+0000) JAXWS-RI/2.2.10-b140803.1500 JAXWS-API/2.2.11 JAXB-RI/2.2.10-b140802.1033 JAXB-API/2.2.12-b140109.1041 svn-revision#unknown. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.1-b419 (branches/2.3.1.x-7937; 2014-08-04T08:11:03+0000) JAXWS-RI/2.2.10-b140803.1500 JAXWS-API/2.2.11 JAXB-RI/2.2.10-b140802.1033 JAXB-API/2.2.12-b140109.1041 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://hw2.pws/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://hw2.pws/" name="CustomerAuthenticationService">
<types>
<xsd:schema>
<xsd:import namespace="http://hw2.pws/" schemaLocation="http://localhost:8080/pws-hw22/CustomerAuthenticationService?xsd=1"/>
</xsd:schema>
</types>
<message name="authenticate">
<part name="parameters" element="tns:authenticate"/>
</message>
<message name="authenticateResponse">
<part name="parameters" element="tns:authenticateResponse"/>
</message>
<portType name="CustomerAuthenticationService">
<operation name="authenticate">
<input wsam:Action="http://hw2.pws/CustomerAuthenticationService/authenticateRequest" message="tns:authenticate"/>
<output wsam:Action="http://hw2.pws/CustomerAuthenticationService/authenticateResponse" message="tns:authenticateResponse"/>
</operation>
</portType>
<binding name="CustomerAuthenticationPortBinding" type="tns:CustomerAuthenticationService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="authenticate">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="CustomerAuthenticationService">
<port name="CustomerAuthenticationPort" binding="tns:CustomerAuthenticationPortBinding">
<soap:address location="http://localhost:8080/pws-hw22/CustomerAuthenticationService"/>
</port>
</service>
</definitions>